MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
			}
			break;

			case(OUTPUT_ON_STATE):
			{
				uint32_t vol = BSP_PWR_VBUSGetVoltage(0)/10; //divide by 10 t oget centivolts since only 4 digit display..
				uint32_t cur = BSP_PWR_VBUSGetCurrent(0);

				//Display output voltage
				max7219_PrintIspecial(SEGMENT_1, vol, 3);

				//Display output current
				max7219_PrintIspecial(SEGMENT_2, cur, 4);

				HAL_Delay(500);

			}
			break;
		}

	//CDC_Transmit_FS(data, strlen(data));

}


/**
 * TIM2 encoder turning interrupt service routine
 */
void encoder_turn_isr(void) {
	//Get the TIM2 value from CNT register
	encoderVal = (TIM3 -> CNT) >> 2;

	if (encoderVal != encoderValPrev){

		switch(currentState)
		{
		case ADJUSTMENT_VOLTAGE:
		{
			//Get direction of encoder turning
			if (encoderVal < encoderValPrev) {
				voltageTemp += val;
			} else {
				voltageTemp -= val;
			}

			//If required temp value is within limits, assign it to voltage
			if (voltageMin <= voltageTemp && voltageTemp <= voltageMax) {
				voltage = voltageTemp;
			} else if (voltageTemp > voltageMax) {
				voltage = voltageMax;
			} else if (voltageTemp < voltageMin) {
				voltage = voltageMin;
			} else {
				//voltageTemp = voltage;
			}
			voltageTemp = voltage;

			// Get number of int numbers in voltage var
			//Print the voltage to the display, set decimal point after digit position 3 (display 1 has positions 4-1)
			max7219_PrintIspecial(SEGMENT_1, voltage, 3);

			//Print to debug
			char _str[40];
			sprintf(_str,"VBUS selected: %d mV", voltage*10);
			USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));

			//Save TIM2 CNT value to ValPrev
			encoderValPrev = encoderVal;
		}
		break;

		case ADJUSTMENT_CURRENT:
		{
			//Get direction of encoder turning
			if (encoderVal < encoderValPrev) {
				currentTemp += val;
			} else {
				currentTemp -= val;
			}

			//If required temp value is within limits, assign it to voltage
			if (currentMin <= currentTemp && currentTemp <= currentMax) {
				current = currentTemp;
			} else {
				currentTemp = current;
			}

			// Get number of int numbers in voltage var
			//Print the voltage to the display, set decimal point after digit position 3 (display 1 has positions 4-1)
			max7219_PrintIspecial(SEGMENT_2, current, 4);

			//Print to debug
			char _str[40];
			sprintf(_str,"IBUS selected: %d mA", current);
			USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));

			//Save TIM2 CNT value to ValPrev
			encoderValPrev = encoderVal;

		}
		break;

		case ADJUSTMENT_CURRENT_OCP:
				{
					//Get direction of encoder turning
					if (encoderVal < encoderValPrev) {
						currentOCPTemp += val;
					} else {
						currentOCPTemp -= val;
					}

					//If required temp value is within limits, assign it to voltage
					if (currentMin <= currentOCPTemp && currentOCPTemp <= currentMax) {
						currentOCP = currentOCPTemp;
					} else {
						currentOCPTemp = currentOCP;
					}

					// Get number of int numbers in voltage var
					//Based on user selected currentOCP calculate the required DAC out...
					V_TRIP = (currentOCP * R_OCP_MOHMS * G_OCP)/1000; // mV (mA * mOhms * Gain)
					//Convert DAC_OUT voltage to 12B resolution
					dac_value = (V_TRIP *4095) / VDDA_APPLI;//__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_12B);

					//Write output with DAC..
					HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dac_value);

					//Print the voltage to the display, set decimal point after digit position 3 (display 1 has positions 4-1)
					max7219_PrintIspecial(SEGMENT_2, currentOCP, 4);

					//Print to debug
					char _str[50];
					sprintf(_str,"OCP_I selected: %d mA", currentOCP);
					USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));

					//Save TIM2 CNT value to ValPrev
					encoderValPrev = encoderVal;

				}
				break;

		}
	}
}


/**
 * Button interrupt service routine
 */
void button_isr(void){
	/*
	const char response[] = "POWER is ON\r\n";
	        LPUART_Transmit(LPUART2, (const uint8_t*)response, sizeof(response) - 1);*/

	//Mask unwanted button interrupts caused by debouncing on exti line 3 (PD8)
	EXTI->IMR1 &= ~(EXTI_IMR1_IM8);

	//Set debouncing time in ms
	TIM7->ARR = 200;

	//Zero TIM7 counter and start counting
	LL_TIM_SetCounter(TIM7, 0); //set counter register value of timer 7 to 0
	LL_TIM_EnableCounter(TIM7); //start counting of timer 7

	//Decrement encoderPress value if higher than 4
	if (encoderPress > 1){
		encoderPress--;
	}
	else {
		encoderPress = 4;
	}

	//Choose addition value based on encoderPress val and current ADJUSTMENT_STATE (voltage/current)
	switch (currentState){
		case ADJUSTMENT_VOLTAGE:
			switch (encoderPress) {
			case 1: val = 2; break;
			case 2: val = 10; break;
			case 3: val = 100; break;
			case 4: val = 1000; break;
			}
		 break;
		case ADJUSTMENT_CURRENT_OCP:
		case ADJUSTMENT_CURRENT:
			switch (encoderPress) {
			case 1: val = 5; break;
			case 2: val = 10; break;
			case 3: val = 100; break;
			case 4: val = 1000; break;
			}
		 break;
	}

	char _str[60];
	uint32_t voltageADC = BSP_PWR_VBUSGetVoltage(0);
	uint32_t currentADC= BSP_PWR_VBUSGetCurrent(0);
	uint32_t currentOCP_ADC= BSP_PWR_VBUSGetCurrentOCP(0);

	// Use snprintf to limit the number of characters written
	int len = snprintf(_str, sizeof(_str), "VBUS:%lu mV, IBUS:%lu mA, IOCP:%lu mA", voltageADC, currentADC, currentOCP_ADC);

	USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));

	//Erase btn (PC3) interrupt flag
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_3);

}

/*
 * Timer interrupt routine
 */
void button_timer_isr(void){
	//Unmask exti line 1, 2 and 3
	EXTI->IMR1 |= EXTI_IMR1_IM8; //unmask interrupt mask register on exti line 3 (PD8)
	EXTI->IMR1 |= EXTI_IMR1_IM2; //unmask interrupt mask register on exti line 2 (PB2)
	EXTI->IMR1 |= EXTI_IMR1_IM1; //unmask interrupt mask register on exti line 1 (PB1)

	//Clear update flag on TIM7
	LL_TIM_ClearFlag_UPDATE(TIM7); //Clear update flag on TIMER7
}

/*
 * Timer interrupt routine
 */
void timer14_isr(void){
	//Unmask exti line 6
	EXTI->IMR1 |= EXTI_IMR1_IM6; //unmask interrupt (PB6)

